In [29]:
import numpy as np 
import pandas as pd 

from sklearn.ensemble import RandomForestClassifier

In [13]:
train_data = pd.read_csv("/Users/minyoungxi/DataScience/kaggle/titanic/data/train.csv")
test_data = pd.read_csv("/Users/minyoungxi/DataScience/kaggle/titanic/data/test.csv")

In [15]:
train_data.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [16]:
test_data.head()

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
2,894,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q
3,895,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S
4,896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S

## 성별에 따른 생존율 구하기

In [20]:
women = train_data.loc[train_data.Sex == 'female']['Survived']
rate_women = sum(women) / len(women)

print(rate_women)

0.7420382165605095

In [21]:
men = train_data.loc[train_data.Sex == 'male']['Survived']
rate_men = sum(men) / len(men)

print(rate_men)

0.18890814558058924

In [22]:
print("% of women who survived: ", rate_women)
print("% of men who survived: ", rate_men)

% of women who survived:  0.7420382165605095
% of men who survived:  0.18890814558058924

## ML

In [23]:
target = train_data["Survived"]
features = ['Pclass', 'Sex', 'SibSp', 'Parch']

In [25]:
train_data[features]

     Pclass     Sex  SibSp  Parch
0         3    male      1      0
1         1  female      1      0
2         3  female      0      0
3         1  female      1      0
4         3    male      0      0
..      ...     ...    ...    ...
886       2    male      0      0
887       1  female      0      0
888       3  female      1      2
889       1    male      0      0
890       3    male      0      0

[891 rows x 4 columns]

#### pd.get_dummies

* 범주형 데이터가 존재할 경우 이를 수치화 하는 대표적인 방법 
* Pandas에서는 get_dummies 라는 one-hot encoding 을 실행하는 함수를 지원합니다. 
* 범주의 갯수만큼 dummy variable을 만들어 0 또는 1을 각 범주마다 할당해서 새로운 특성으로 바꾸는 방법.
* Sex 컬럼은 male과 female 2개의 범주에 대해서 2개의 dummy variable을 할당한뒤 male/female 마다 각각 0또는 1을 할당

In [27]:
X = pd.get_dummies(train_data[features])
X_test = pd.get_dummies(test_data[features])

In [30]:
model = RandomForestClassifier(n_estimators=100, max_depth=5, random_state=1)

model.fit(X, target)
predictions = model.predict(X_test)

In [33]:
output = pd.DataFrame({'PassengerId': test_data.PassengerId, 'Survived': predictions})
output.to_csv('my_submission.csv', index=False)

In [34]:
output.head()

   PassengerId  Survived
0          892         0
1          893         1
2          894         0
3          895         0
4          896         1